"""
На входе многомерный список, каждый элемент содержит информацию о товаре,
 количестве и цене, которые были в каком-то заказе. Например: [[Товар1, 1,500],
 [Товар2, 7,1000],[Товар1, 6,900]]
 Вывести словарь:{Товар:Общая сумма заказа}
"""
orders = [["Товар1", 1,500], ["Товар2", 7,1000],["Товар1", 6,900], ["Товар1", 3,700], ["Товар2", 7,1000],["Товар3", 2,550], ["Товар4", 7,300],["Товар5", 2,300]]

product = sorted(set(arr[0] for arr in orders))
product = dict.fromkeys(product, 0)
for arr in orders:
    product[arr[0]] += arr[1] * arr[2]
print(product)